{
  "type": "daily",
  "id": "26-02-11",
  "title": "Wednesday, Feb 11",
  "dateRange": "February 11, 2026",
  "date": "2026-02-11",
  "generatedAt": "2026-02-11T07:34:31.829Z",
  "highlights": [
    {
      "title": "With co-founders leaving and an IPO looming, Elon Musk turns talk to the moon",
      "link": "https://techcrunch.com/2026/02/10/with-co-founders-leaving-and-an-ipo-looming-elon-musk-turns-talk-to-the-moon/",
      "description": "According to The New York Times, which reports that it heard the meeting, Musk told employees that xAI needs a lunar manufacturing facility, a factory on the moon that will build AI satellites and fling them into space via a giant catapult.",
      "published": "2026-02-11T05:23:26.000Z",
      "source": "TechCrunch",
      "sourceKey": "techcrunch",
      "priority": 1,
      "image": null,
      "relevanceScore": 11,
      "matchedKeywords": [
        "xai",
        "ipo",
        "elon musk",
        "satellite"
      ],
      "category": "ai"
    },
    {
      "title": "Okay, now exactly half of xAI’s founding team has left the company",
      "link": "https://techcrunch.com/2026/02/10/nearly-half-of-xais-founding-team-has-now-left-the-company/",
      "description": "Whatever the cause of the departures, the cumulative impact is alarming. There is a lot of work left to do at xAI, and an IPO will bring more scrutiny than the lab has ever faced before.",
      "published": "2026-02-11T01:50:00.000Z",
      "source": "TechCrunch",
      "sourceKey": "techcrunch",
      "priority": 1,
      "image": null,
      "relevanceScore": 11,
      "matchedKeywords": [
        "arm",
        "xai",
        "ipo"
      ],
      "category": "ai"
    },
    {
      "title": "Musk's xAI loses second co-founder in two days",
      "link": "https://www.cnbc.com/2026/02/10/musks-xai-loses-second-co-founder-in-two-days-as-jimmy-ba-departs.html",
      "description": "After SpaceX merger, xAI is shedding co-founders with influential researcher Jimmy Ba the latest to depart.",
      "published": "2026-02-11T01:52:08.000Z",
      "source": "CNBC",
      "sourceKey": "cnbc_tech",
      "priority": 1,
      "image": null,
      "relevanceScore": 10,
      "matchedKeywords": [
        "spacex",
        "xai",
        "merger"
      ],
      "category": "ai"
    },
    {
      "title": "Tim Cook promises Apple will celebrate its upcoming 50th anniversary",
      "link": "https://9to5mac.com/2026/02/10/tim-cook-promises-apple-will-celebrate-its-upcoming-50th-anniversary/",
      "description": "Apple was founded on April 1, 1976, which means this year marks the company’s 50th anniversary. In a recent all-hands meeting with employees, Apple CEO Tim Cook teased that Apple is planning a celebration for this historic milestone.\nmore…",
      "published": "2026-02-11T01:22:35.000Z",
      "source": "9to5Mac",
      "sourceKey": "9to5mac",
      "priority": 2,
      "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/08/iPhone-17-event-scheduled-for-September-9-according-to-carrier-documents.jpg?quality=82&#038;strip=all&#038;w=1600",
      "relevanceScore": 10,
      "matchedKeywords": [
        "apple",
        "ceo",
        "tim cook"
      ],
      "category": "business"
    },
    {
      "title": "OpenAI policy exec who opposed chatbot’s “adult mode” reportedly fired on discrimination claim",
      "link": "https://techcrunch.com/2026/02/10/openai-policy-exec-who-opposed-chatbots-adult-mode-reportedly-fired-on-discrimination-claim/",
      "description": "The executive has denied the allegation that she engaged in discrimination.",
      "published": "2026-02-11T02:15:27.000Z",
      "source": "TechCrunch",
      "sourceKey": "techcrunch",
      "priority": 1,
      "image": null,
      "relevanceScore": 8,
      "matchedKeywords": [
        "openai"
      ],
      "category": "ai"
    },
    {
      "title": "Salesforce employees call on CEO Benioff to cancel ICE 'opportunities'",
      "link": "https://www.cnbc.com/2026/02/10/salesforce-employees-call-on-ceo-benioff-to-cancel-ice-opportunities.html",
      "description": "More than 1,400 Salesforce employees have signed a letter calling on CEO Marc Benioff to cancel all potential business with the U.S. ICE agency.",
      "published": "2026-02-11T03:46:34.000Z",
      "source": "CNBC",
      "sourceKey": "cnbc_tech",
      "priority": 1,
      "image": null,
      "relevanceScore": 8,
      "matchedKeywords": [
        "salesforce",
        "ceo"
      ],
      "category": "ev_autonomous"
    },
    {
      "title": "Samsung Galaxy Unpacked 2026: Everything we're expecting from the S26 launch on February 25",
      "link": "https://www.engadget.com/mobile/smartphones/samsung-galaxy-unpacked-2026-everything-were-expecting-from-the-s26-launch-on-february-25-130000524.html?src=rss",
      "description": "Samsung’s 2025 was filled with new foldables, an ultra-thin new form factor and the launch of Google's XR platform. After making some announcements at CES 2026, the company has just announced its first Galaxy Unpacked of the year will take place on February 25, where it is expected to introduce the Galaxy S26 lineup. Official invites have just been shared, but actual information on what devices are arriving then is still unknown. But as usual, we know a lot about what’s expected at Unpacked.\nEngadget will be covering Galaxy Unpacked live, and we'll most likely have hands-on coverage of Samsung's new smartphones soon after they're announced. While we wait for the full details, here's everything we expect Samsung will introduce at the first Galaxy Unpacked event of 2026.\n\n\n\nWhen is Unpacked 2026 taking place?\nAccording to the official invite that Samsung shared on February 10, Unpacked will happen on February 25, 2026 in San Francisco. The keynote will start at 10AM PT (1PM ET) and be livestreamed on Samsung.com, as well as the company’s newsroom and YouTube channel. The announcement on February 10 also said this launch will mark “a new phase in the era of AI as intelligence becomes truly personal and adaptive.” It’s not a lot to go on, since we’ve heard a version of this from various companies over the last few years, but at least we won’t be shocked when we hear more about AI in just about two weeks.\nGalaxy S26, S26+ and S26 Ultra\nSamsung Galaxy S25 Ultra hands-on photo\nPhoto by Sam Rutherford/Engadget\n\nSamsung's restrained approach to updating its phones will likely continue with the Galaxy S26. Based on leaked images of the new lineup, the company is not expected to radically reinvent the look of the Galaxy S26, Galaxy S26+ or Galaxy S26 Ultra, and instead will stick with a similar design to what it used on the Galaxy S25. The phones will have a flat front screen and frame, with rounded corners and cameras housed in a vertical pill-shaped plateau on the back. Unlike Apple's move from the iPhone 16 Pro to the iPhone 17 Pro, the biggest difference here will likely be internal components like the screens, chips and camera sensors Samsung uses.\nQualcomm's new Snapdragon 8 Elite Gen 5 chip is expected to be in all Samsung Galaxy S26 phones, though Korean news site Yonhap News reports Samsung's relatively new Exynos 2600 chip could be used in some phones in the lineup depending on the region, a strategy Samsung has deployed in the past. Either way the new phones should be more performant than the previous generation, and in the case of the models with the Snapdragon 8 Elite Gen 5, particularly good at on-device AI processing.\n\nI have compiled the most accurate comprehensive parameter comparison of Galaxy S25, S25+ and Galaxy S26、 S26+. Which one do you want to buy? pic.twitter.com/aQpoSvYjOz\n— Ice Universe (@UniverseIce) November 29, 2025\n\nOne notable difference between the Galaxy S26 and the Galaxy S25 could be the phone's screen. The new phone will reportedly feature a 6.3-inch FHD+ display according to specs shared by leaker Ice Universe, which makes it ever so slightly larger than the 6.2-inch display used on the Galaxy S25. The S26 will also allegedly come with 12GB of RAM, either 256GB or 512GB of storage and a slightly larger 4,300mAh battery. Samsung isn't changing the cameras on the entry-level phone, though: leaks suggest it'll feature the same 50-megapixel main camera, 12-megapixel ultrawide, 10-megapixel 3x telephoto and 12-megapixel selfie camera as the previous generation. Changes appear to be even more minor on the Galaxy S26+. Other than the new Snapdragon chip, the phone will reportedly feature the same 6.7-inch FHD+ screen, 4,900mAh battery, 12GB of RAM and the same camera array used on the base Galaxy S26.\nThe difference between the Galaxy S26 Ultra and Galaxy S25 Ultra is reportedly a bit clearer. According to Android Headlines, the new phone's cameras will be slightly more raised, and stand out thanks to a new metallic finish. Samsung may also switch back to using an aluminum frame on the Galaxy S26 Ultra, after using titanium frames on both the Galaxy S24 and S25 Ultras. Most importantly, to make the phone actually support Qi2 rather than only technically work with the standard when a case is attached, rumors suggest Samsung will remove the S Pen digitizer layer in the phone and adopt a new method for accepting stylus input. It's not clear what that new method will actually be, but it could let the Galaxy S26 Ultra more easily work with Qi2 accessories without losing its stylus.\nAndroid Headlines also recently shared what appear to be full image renders of the S26 series, and they generally line up with what has already been rumored, leaked and reported so far. If these pictures are accurate, they give us a clearer look at the camera bump and two color variants of the S26 Ultra.\nFans of magnets may continue to be disappointed by Samsung if the latest rumors are accurate. Despite the launch of the Qi 2 wireless charging standard adding support for convenient magnetic alignment years ago, Samsung has yet to bring that feature to its phones. Though the S-series have the higher speed charging rates that the spec enables,  Nieuwemobiel.nl is reporting that, due to images it received of cases with magnetic rings, the S26 series likely won’t have built-in magnets. Samsung has made these cases to add the magnetic capability to its S-series in the past, and the existence of the images of these accessories lends weight to the idea that the company will continue this approach.\nGalaxy Buds 4\nGalaxy Buds 3 Pro in case.\nEngadget\n\nSamsung released the Galaxy Buds 3 and 3 Pro in 2024, with a major redesign that brought them much more in line with Apple's AirPods. The Galaxy Buds 4 and Buds 4 Pro Samsung is rumored to be announcing soon won't necessarily change that, though they will feature a more compact case and less angular stems, according to leaked images from the Samsung Tips app.\nSupport for head gestures to accept and decline calls, a feature Apple includes on the AirPods Pro 3 and AirPods 4, is also rumored to work on both versions of the new Galaxy Buds. SamMobile reports the Galaxy Buds 4 and 4 Pro may also ship with a new Ultra Wideband chip that will make them easier to find with Google's Find Hub network.\nGalaxy Z Trifold\nYes, the TriFold has a crease, two in fact. But they still don't ruin the experience. \nSam Rutherford for Engadget\n\nSamsung announced the Galaxy Z TriFold in late 2025 without firm details of when the new smartphone-that-folds-into-a-tablet would be available in North America. That info came on January 27, when the company announced the TriFold would be available in the US on January 30, for a whopping $2,900. Considering we’ve already seen the device in person at CES 2026 and people are most likely to have had a chance to look at, if not buy the foldable for themselves by the time Unpacked rolls around, we don’t expect Samsung to spend too much time dwelling on it, if at all.\nGalaxy S26 Edge\nAt just 5.8mm thick, the Samsung Galaxy S25 Edge is one of the thinnest smartphones ever made. \nSam Rutherford for Engadget\n\nWhen the Galaxy S25 Edge was announced in 2025, it seemed possible that Samsung could replace its \"Plus\" smartphone with a unique form factor, just like Apple has opted to do with the iPhone Air. There have been conflicting reports on the matter, but it seems like Samsung will not be doing that with the Galaxy S26 Edge.\nInstead, the smartphone will reportedly remain another option, much like foldables are for customers not swayed by Samsung's traditional smartphones. The Galaxy S26 Edge is rumored to feature a slightly different design than last year's model, according to Android Headlines, with a large rectangular camera plateau that's reminiscent of Google's Pixel phones, and the raised oval Apple used on the iPhone Air. Beyond that, the phone is also expected to be ever so slightly thinner at 5.5mm than the 5.8mm Galaxy S25 Edge.\nBixby and other AI features\n\n\nSamsung already acts as a first place Google can show off new AI features for Android, but the company is reportedly exploring other AI partnerships, too. In June 2025, Bloomberg reported that Samsung was nearing a deal with Perplexity to integrate its AI-powered search engine across OneUI and its homegrown mobile browser. Perplexity already has a deal with Motorola on its Razr phones, so the only thing that would make a deal with Samsung unusual is the close relationship the company already has with Google.\nThe company also accidentally announced a new version of its Bixby AI assistant, which will likely also be integrated with Perplexity and could serve as an alternative to Google Gemini. Both a new Bixby and a deeper integration with Perplexity seem like natural new software features to show off at Galaxy Unpacked.\nUpdate, January 27 2026, 11:55AM ET: This story has been updated to reflect the latest news around the Galaxy Z TriFold’s price and availability in the US.\nUpdate, January 30 2026, 12:45PM ET: This story has been updated to include the latest leaks on the possible dates for Unpacked 2026.\nUpdate, February 02 2026, 11:30AM ET: This story has been updated to include the latest leaks with full image renders of the S26 trio of devices.\nUpdate, February 03 2026, 11:00AM ET: This story has been updated to include the latest leaks about the possible lack of magnetic support on the S26 series.\nUpdate, February 10 2026, 7:15PM ET: This story has been updated to include the official date of Galaxy Unpacked as Samsung announced it today. The intro was also edited to reflect that detail.\nThis article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/samsung-galaxy-unpacked-2026-everything-were-expecting-from-the-s26-launch-on-february-25-130000524.html?src=rss",
      "published": "2026-02-11T00:17:12.000Z",
      "source": "Engadget",
      "sourceKey": "engadget",
      "priority": 2,
      "image": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-01/59db82d0-d8d0-11ef-babd-deb856accfc5",
      "relevanceScore": 6,
      "matchedKeywords": [
        "google",
        "samsung"
      ],
      "category": "ai"
    },
    {
      "title": "China’s Top Chipmaker Warns Rushed AI Capacity Could Sit Idle",
      "link": "https://www.bloomberg.com/news/articles/2026-02-11/china-s-top-chipmaker-warns-rushed-ai-capacity-could-sit-idle",
      "description": "China’s top chipmaker has warned that breakaway spending on artificial intelligence chips is bringing forward years of future demand, raising the risk that some data centers could sit idle.",
      "published": "2026-02-11T05:33:22.000Z",
      "source": "Bloomberg",
      "sourceKey": "bloomberg_tech",
      "priority": 1,
      "image": null,
      "relevanceScore": 6,
      "matchedKeywords": [
        "intel",
        "artificial intelligence",
        "chip",
        "data center"
      ],
      "category": "ai"
    },
    {
      "title": "Samsung Shares Reverse Drop After Executive Touts HBM4 Advantage",
      "link": "https://www.bloomberg.com/news/articles/2026-02-11/samsung-shares-reverse-drop-after-executive-touts-hbm4-advantage",
      "description": "Samsung Electronics Co. is back at the top of the memory industry with its new HBM4 technology, President and chip division Chief Technology Officer Jaihyuk Song said on Wednesday, erasing a drop in the company’s shares.",
      "published": "2026-02-11T02:38:05.000Z",
      "source": "Bloomberg",
      "sourceKey": "bloomberg_tech",
      "priority": 1,
      "image": null,
      "relevanceScore": 6,
      "matchedKeywords": [
        "samsung",
        "chip"
      ],
      "category": "ai"
    },
    {
      "title": "Samsung to hold its Galaxy S26 event on February 25",
      "link": "https://techcrunch.com/2026/02/10/samsung-to-hold-its-galaxy-s26-event-on-february-25/",
      "description": "Samsung is going to launch S26 lineup just before Mobile World Congress (MWC).",
      "published": "2026-02-11T07:06:44.000Z",
      "source": "TechCrunch",
      "sourceKey": "techcrunch",
      "priority": 1,
      "image": null,
      "relevanceScore": 5,
      "matchedKeywords": [
        "samsung"
      ],
      "category": "regulation"
    }
  ],
  "byCategory": {
    "ai": [
      {
        "title": "With co-founders leaving and an IPO looming, Elon Musk turns talk to the moon",
        "link": "https://techcrunch.com/2026/02/10/with-co-founders-leaving-and-an-ipo-looming-elon-musk-turns-talk-to-the-moon/",
        "description": "According to The New York Times, which reports that it heard the meeting, Musk told employees that xAI needs a lunar manufacturing facility, a factory on the moon that will build AI satellites and fling them into space via a giant catapult.",
        "published": "2026-02-11T05:23:26.000Z",
        "source": "TechCrunch",
        "sourceKey": "techcrunch",
        "priority": 1,
        "image": null,
        "relevanceScore": 11,
        "matchedKeywords": [
          "xai",
          "ipo",
          "elon musk",
          "satellite"
        ],
        "category": "ai"
      },
      {
        "title": "Okay, now exactly half of xAI’s founding team has left the company",
        "link": "https://techcrunch.com/2026/02/10/nearly-half-of-xais-founding-team-has-now-left-the-company/",
        "description": "Whatever the cause of the departures, the cumulative impact is alarming. There is a lot of work left to do at xAI, and an IPO will bring more scrutiny than the lab has ever faced before.",
        "published": "2026-02-11T01:50:00.000Z",
        "source": "TechCrunch",
        "sourceKey": "techcrunch",
        "priority": 1,
        "image": null,
        "relevanceScore": 11,
        "matchedKeywords": [
          "arm",
          "xai",
          "ipo"
        ],
        "category": "ai"
      },
      {
        "title": "Musk's xAI loses second co-founder in two days",
        "link": "https://www.cnbc.com/2026/02/10/musks-xai-loses-second-co-founder-in-two-days-as-jimmy-ba-departs.html",
        "description": "After SpaceX merger, xAI is shedding co-founders with influential researcher Jimmy Ba the latest to depart.",
        "published": "2026-02-11T01:52:08.000Z",
        "source": "CNBC",
        "sourceKey": "cnbc_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 10,
        "matchedKeywords": [
          "spacex",
          "xai",
          "merger"
        ],
        "category": "ai"
      },
      {
        "title": "OpenAI policy exec who opposed chatbot’s “adult mode” reportedly fired on discrimination claim",
        "link": "https://techcrunch.com/2026/02/10/openai-policy-exec-who-opposed-chatbots-adult-mode-reportedly-fired-on-discrimination-claim/",
        "description": "The executive has denied the allegation that she engaged in discrimination.",
        "published": "2026-02-11T02:15:27.000Z",
        "source": "TechCrunch",
        "sourceKey": "techcrunch",
        "priority": 1,
        "image": null,
        "relevanceScore": 8,
        "matchedKeywords": [
          "openai"
        ],
        "category": "ai"
      },
      {
        "title": "Samsung Galaxy Unpacked 2026: Everything we're expecting from the S26 launch on February 25",
        "link": "https://www.engadget.com/mobile/smartphones/samsung-galaxy-unpacked-2026-everything-were-expecting-from-the-s26-launch-on-february-25-130000524.html?src=rss",
        "description": "Samsung’s 2025 was filled with new foldables, an ultra-thin new form factor and the launch of Google's XR platform. After making some announcements at CES 2026, the company has just announced its first Galaxy Unpacked of the year will take place on February 25, where it is expected to introduce the Galaxy S26 lineup. Official invites have just been shared, but actual information on what devices are arriving then is still unknown. But as usual, we know a lot about what’s expected at Unpacked.\nEngadget will be covering Galaxy Unpacked live, and we'll most likely have hands-on coverage of Samsung's new smartphones soon after they're announced. While we wait for the full details, here's everything we expect Samsung will introduce at the first Galaxy Unpacked event of 2026.\n\n\n\nWhen is Unpacked 2026 taking place?\nAccording to the official invite that Samsung shared on February 10, Unpacked will happen on February 25, 2026 in San Francisco. The keynote will start at 10AM PT (1PM ET) and be livestreamed on Samsung.com, as well as the company’s newsroom and YouTube channel. The announcement on February 10 also said this launch will mark “a new phase in the era of AI as intelligence becomes truly personal and adaptive.” It’s not a lot to go on, since we’ve heard a version of this from various companies over the last few years, but at least we won’t be shocked when we hear more about AI in just about two weeks.\nGalaxy S26, S26+ and S26 Ultra\nSamsung Galaxy S25 Ultra hands-on photo\nPhoto by Sam Rutherford/Engadget\n\nSamsung's restrained approach to updating its phones will likely continue with the Galaxy S26. Based on leaked images of the new lineup, the company is not expected to radically reinvent the look of the Galaxy S26, Galaxy S26+ or Galaxy S26 Ultra, and instead will stick with a similar design to what it used on the Galaxy S25. The phones will have a flat front screen and frame, with rounded corners and cameras housed in a vertical pill-shaped plateau on the back. Unlike Apple's move from the iPhone 16 Pro to the iPhone 17 Pro, the biggest difference here will likely be internal components like the screens, chips and camera sensors Samsung uses.\nQualcomm's new Snapdragon 8 Elite Gen 5 chip is expected to be in all Samsung Galaxy S26 phones, though Korean news site Yonhap News reports Samsung's relatively new Exynos 2600 chip could be used in some phones in the lineup depending on the region, a strategy Samsung has deployed in the past. Either way the new phones should be more performant than the previous generation, and in the case of the models with the Snapdragon 8 Elite Gen 5, particularly good at on-device AI processing.\n\nI have compiled the most accurate comprehensive parameter comparison of Galaxy S25, S25+ and Galaxy S26、 S26+. Which one do you want to buy? pic.twitter.com/aQpoSvYjOz\n— Ice Universe (@UniverseIce) November 29, 2025\n\nOne notable difference between the Galaxy S26 and the Galaxy S25 could be the phone's screen. The new phone will reportedly feature a 6.3-inch FHD+ display according to specs shared by leaker Ice Universe, which makes it ever so slightly larger than the 6.2-inch display used on the Galaxy S25. The S26 will also allegedly come with 12GB of RAM, either 256GB or 512GB of storage and a slightly larger 4,300mAh battery. Samsung isn't changing the cameras on the entry-level phone, though: leaks suggest it'll feature the same 50-megapixel main camera, 12-megapixel ultrawide, 10-megapixel 3x telephoto and 12-megapixel selfie camera as the previous generation. Changes appear to be even more minor on the Galaxy S26+. Other than the new Snapdragon chip, the phone will reportedly feature the same 6.7-inch FHD+ screen, 4,900mAh battery, 12GB of RAM and the same camera array used on the base Galaxy S26.\nThe difference between the Galaxy S26 Ultra and Galaxy S25 Ultra is reportedly a bit clearer. According to Android Headlines, the new phone's cameras will be slightly more raised, and stand out thanks to a new metallic finish. Samsung may also switch back to using an aluminum frame on the Galaxy S26 Ultra, after using titanium frames on both the Galaxy S24 and S25 Ultras. Most importantly, to make the phone actually support Qi2 rather than only technically work with the standard when a case is attached, rumors suggest Samsung will remove the S Pen digitizer layer in the phone and adopt a new method for accepting stylus input. It's not clear what that new method will actually be, but it could let the Galaxy S26 Ultra more easily work with Qi2 accessories without losing its stylus.\nAndroid Headlines also recently shared what appear to be full image renders of the S26 series, and they generally line up with what has already been rumored, leaked and reported so far. If these pictures are accurate, they give us a clearer look at the camera bump and two color variants of the S26 Ultra.\nFans of magnets may continue to be disappointed by Samsung if the latest rumors are accurate. Despite the launch of the Qi 2 wireless charging standard adding support for convenient magnetic alignment years ago, Samsung has yet to bring that feature to its phones. Though the S-series have the higher speed charging rates that the spec enables,  Nieuwemobiel.nl is reporting that, due to images it received of cases with magnetic rings, the S26 series likely won’t have built-in magnets. Samsung has made these cases to add the magnetic capability to its S-series in the past, and the existence of the images of these accessories lends weight to the idea that the company will continue this approach.\nGalaxy Buds 4\nGalaxy Buds 3 Pro in case.\nEngadget\n\nSamsung released the Galaxy Buds 3 and 3 Pro in 2024, with a major redesign that brought them much more in line with Apple's AirPods. The Galaxy Buds 4 and Buds 4 Pro Samsung is rumored to be announcing soon won't necessarily change that, though they will feature a more compact case and less angular stems, according to leaked images from the Samsung Tips app.\nSupport for head gestures to accept and decline calls, a feature Apple includes on the AirPods Pro 3 and AirPods 4, is also rumored to work on both versions of the new Galaxy Buds. SamMobile reports the Galaxy Buds 4 and 4 Pro may also ship with a new Ultra Wideband chip that will make them easier to find with Google's Find Hub network.\nGalaxy Z Trifold\nYes, the TriFold has a crease, two in fact. But they still don't ruin the experience. \nSam Rutherford for Engadget\n\nSamsung announced the Galaxy Z TriFold in late 2025 without firm details of when the new smartphone-that-folds-into-a-tablet would be available in North America. That info came on January 27, when the company announced the TriFold would be available in the US on January 30, for a whopping $2,900. Considering we’ve already seen the device in person at CES 2026 and people are most likely to have had a chance to look at, if not buy the foldable for themselves by the time Unpacked rolls around, we don’t expect Samsung to spend too much time dwelling on it, if at all.\nGalaxy S26 Edge\nAt just 5.8mm thick, the Samsung Galaxy S25 Edge is one of the thinnest smartphones ever made. \nSam Rutherford for Engadget\n\nWhen the Galaxy S25 Edge was announced in 2025, it seemed possible that Samsung could replace its \"Plus\" smartphone with a unique form factor, just like Apple has opted to do with the iPhone Air. There have been conflicting reports on the matter, but it seems like Samsung will not be doing that with the Galaxy S26 Edge.\nInstead, the smartphone will reportedly remain another option, much like foldables are for customers not swayed by Samsung's traditional smartphones. The Galaxy S26 Edge is rumored to feature a slightly different design than last year's model, according to Android Headlines, with a large rectangular camera plateau that's reminiscent of Google's Pixel phones, and the raised oval Apple used on the iPhone Air. Beyond that, the phone is also expected to be ever so slightly thinner at 5.5mm than the 5.8mm Galaxy S25 Edge.\nBixby and other AI features\n\n\nSamsung already acts as a first place Google can show off new AI features for Android, but the company is reportedly exploring other AI partnerships, too. In June 2025, Bloomberg reported that Samsung was nearing a deal with Perplexity to integrate its AI-powered search engine across OneUI and its homegrown mobile browser. Perplexity already has a deal with Motorola on its Razr phones, so the only thing that would make a deal with Samsung unusual is the close relationship the company already has with Google.\nThe company also accidentally announced a new version of its Bixby AI assistant, which will likely also be integrated with Perplexity and could serve as an alternative to Google Gemini. Both a new Bixby and a deeper integration with Perplexity seem like natural new software features to show off at Galaxy Unpacked.\nUpdate, January 27 2026, 11:55AM ET: This story has been updated to reflect the latest news around the Galaxy Z TriFold’s price and availability in the US.\nUpdate, January 30 2026, 12:45PM ET: This story has been updated to include the latest leaks on the possible dates for Unpacked 2026.\nUpdate, February 02 2026, 11:30AM ET: This story has been updated to include the latest leaks with full image renders of the S26 trio of devices.\nUpdate, February 03 2026, 11:00AM ET: This story has been updated to include the latest leaks about the possible lack of magnetic support on the S26 series.\nUpdate, February 10 2026, 7:15PM ET: This story has been updated to include the official date of Galaxy Unpacked as Samsung announced it today. The intro was also edited to reflect that detail.\nThis article originally appeared on Engadget at https://www.engadget.com/mobile/smartphones/samsung-galaxy-unpacked-2026-everything-were-expecting-from-the-s26-launch-on-february-25-130000524.html?src=rss",
        "published": "2026-02-11T00:17:12.000Z",
        "source": "Engadget",
        "sourceKey": "engadget",
        "priority": 2,
        "image": "https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2025-01/59db82d0-d8d0-11ef-babd-deb856accfc5",
        "relevanceScore": 6,
        "matchedKeywords": [
          "google",
          "samsung"
        ],
        "category": "ai"
      },
      {
        "title": "China’s Top Chipmaker Warns Rushed AI Capacity Could Sit Idle",
        "link": "https://www.bloomberg.com/news/articles/2026-02-11/china-s-top-chipmaker-warns-rushed-ai-capacity-could-sit-idle",
        "description": "China’s top chipmaker has warned that breakaway spending on artificial intelligence chips is bringing forward years of future demand, raising the risk that some data centers could sit idle.",
        "published": "2026-02-11T05:33:22.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 6,
        "matchedKeywords": [
          "intel",
          "artificial intelligence",
          "chip",
          "data center"
        ],
        "category": "ai"
      },
      {
        "title": "Samsung Shares Reverse Drop After Executive Touts HBM4 Advantage",
        "link": "https://www.bloomberg.com/news/articles/2026-02-11/samsung-shares-reverse-drop-after-executive-touts-hbm4-advantage",
        "description": "Samsung Electronics Co. is back at the top of the memory industry with its new HBM4 technology, President and chip division Chief Technology Officer Jaihyuk Song said on Wednesday, erasing a drop in the company’s shares.",
        "published": "2026-02-11T02:38:05.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 6,
        "matchedKeywords": [
          "samsung",
          "chip"
        ],
        "category": "ai"
      },
      {
        "title": "Amazon Ring’s Super Bowl ad sparks backlash amid fears of mass surveillance",
        "link": "https://www.theverge.com/tech/876866/ring-search-party-super-bowl-ad-online-backlash",
        "description": "The ad promotes Ring cameras’ new capability to search neighborhoods for a lost dog. | Screenshot from Ring video\t\n\nRing's new Search Party feature has once again drawn backlash for the company. A 30-second ad that aired during Sunday's Super Bowl showed Ring cameras \"surveilling\" neighborhoods to locate a lost dog. In the current political climate, a prime-time ad celebrating neighborhood surveillance struck a nerve.\nPeople voiced concerns across social media that the AI-powered technology Ring uses to identify dogs could soon be used to search for humans. Combined with Ring's recent rollout of its new facial recognition capability, it feels like a short leap for a pet-finding feature to be turned into a tool for state surveillance. \nPrivacy expert Chr …\nRead the full story at The Verge.",
        "published": "2026-02-11T01:17:36.000Z",
        "source": "The Verge",
        "sourceKey": "theverge",
        "priority": 1,
        "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/Screenshot-2026-02-10-at-7.36.46%E2%80%AFPM.png?quality=90&#038;strip=all&#038;crop=0,0,100,100",
        "relevanceScore": 5,
        "matchedKeywords": [
          "amazon"
        ],
        "category": "ai"
      },
      {
        "title": "AI Loser Software Stocks Overshadowed as Hardware Earnings Jump",
        "link": "https://www.bloomberg.com/news/articles/2026-02-11/ai-loser-software-stocks-overshadowed-as-hardware-earnings-jump",
        "description": "Europe’s software companies are set for slower earnings growth than their hardware counterparts this year, compounding fears in global markets that artificial intelligence will reshape software firms’ business models.",
        "published": "2026-02-11T05:30:00.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 4,
        "matchedKeywords": [
          "intel",
          "artificial intelligence"
        ],
        "category": "ai"
      },
      {
        "title": "Wall Street’s New Trade: Dump Stocks in AI Crosshairs",
        "link": "https://www.bloomberg.com/news/videos/2026-02-11/wall-street-s-new-trade-dump-stocks-in-ai-crosshairs-video",
        "description": "Rising fears about artificial intelligence are affecting the shares of companies at risk of being disrupted by it, from small software companies to big wealth-management firms. Bloomberg's Stephanie Hughes explains. (Source: Bloomberg)",
        "published": "2026-02-11T02:38:10.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 4,
        "matchedKeywords": [
          "intel",
          "artificial intelligence"
        ],
        "category": "ai"
      },
      {
        "title": "Wall Street’s New Trade Is Dumping Any Stock in AI’s Crosshairs",
        "link": "https://www.bloomberg.com/news/articles/2026-02-11/the-new-ai-stock-trade-is-dumping-any-company-in-its-crosshairs",
        "description": "On Wall Street, rising fears about artificial intelligence keep pummeling shares of companies at risk of being caught on the wrong side of it all, from small software makers to big wealth-management firms.",
        "published": "2026-02-11T00:06:57.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 4,
        "matchedKeywords": [
          "intel",
          "artificial intelligence"
        ],
        "category": "ai"
      },
      {
        "title": "AI connector for Google Calendar makes convenient malware launchpad, researchers show",
        "link": "https://go.theregister.com/feed/www.theregister.com/2026/02/11/claude_desktop_extensions_prompt_injection/",
        "description": "",
        "published": "2026-02-11T00:24:51.000Z",
        "source": "The Register",
        "sourceKey": "theregister",
        "priority": 2,
        "image": null,
        "relevanceScore": 4,
        "matchedKeywords": [
          "google"
        ],
        "category": "ai"
      },
      {
        "title": "Hong Kong working to allow perpetual contracts, chief regulator says",
        "link": "https://www.coindesk.com/policy/2026/02/11/hong-kong-working-to-allow-perpetual-contracts-chief-regulator-says",
        "description": "Hong Kong's Securities and Futures Commission will publish a \"high-level framework\" allowing perpetual contracts, SFC CEO Julia Leung said.",
        "published": "2026-02-11T05:13:18.000Z",
        "source": "CoinDesk",
        "sourceKey": "coindesk",
        "priority": 3,
        "image": null,
        "relevanceScore": 3,
        "matchedKeywords": [
          "ceo"
        ],
        "category": "ai"
      }
    ],
    "business": [
      {
        "title": "Tim Cook promises Apple will celebrate its upcoming 50th anniversary",
        "link": "https://9to5mac.com/2026/02/10/tim-cook-promises-apple-will-celebrate-its-upcoming-50th-anniversary/",
        "description": "Apple was founded on April 1, 1976, which means this year marks the company’s 50th anniversary. In a recent all-hands meeting with employees, Apple CEO Tim Cook teased that Apple is planning a celebration for this historic milestone.\nmore…",
        "published": "2026-02-11T01:22:35.000Z",
        "source": "9to5Mac",
        "sourceKey": "9to5mac",
        "priority": 2,
        "image": "https://9to5mac.com/wp-content/uploads/sites/6/2025/08/iPhone-17-event-scheduled-for-September-9-according-to-carrier-documents.jpg?quality=82&#038;strip=all&#038;w=1600",
        "relevanceScore": 10,
        "matchedKeywords": [
          "apple",
          "ceo",
          "tim cook"
        ],
        "category": "business"
      },
      {
        "title": "Hinge Health CEO on Earnings, AI's Impact on Business",
        "link": "https://www.bloomberg.com/news/videos/2026-02-11/hinge-health-ceo-on-earnings-ai-s-impact-on-business-video",
        "description": "Daniel Perez, co-founder and CEO of Hinge Health, discusses the company’s latest earnings, performance and outlook following the results. He speaks with Scarlet Fu and Katie Greifeld on “The Close.” (Source: Bloomberg)",
        "published": "2026-02-11T00:12:22.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 4,
        "matchedKeywords": [
          "ceo"
        ],
        "category": "business"
      }
    ],
    "ev_autonomous": [
      {
        "title": "Salesforce employees call on CEO Benioff to cancel ICE 'opportunities'",
        "link": "https://www.cnbc.com/2026/02/10/salesforce-employees-call-on-ceo-benioff-to-cancel-ice-opportunities.html",
        "description": "More than 1,400 Salesforce employees have signed a letter calling on CEO Marc Benioff to cancel all potential business with the U.S. ICE agency.",
        "published": "2026-02-11T03:46:34.000Z",
        "source": "CNBC",
        "sourceKey": "cnbc_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 8,
        "matchedKeywords": [
          "salesforce",
          "ceo"
        ],
        "category": "ev_autonomous"
      }
    ],
    "regulation": [
      {
        "title": "Samsung to hold its Galaxy S26 event on February 25",
        "link": "https://techcrunch.com/2026/02/10/samsung-to-hold-its-galaxy-s26-event-on-february-25/",
        "description": "Samsung is going to launch S26 lineup just before Mobile World Congress (MWC).",
        "published": "2026-02-11T07:06:44.000Z",
        "source": "TechCrunch",
        "sourceKey": "techcrunch",
        "priority": 1,
        "image": null,
        "relevanceScore": 5,
        "matchedKeywords": [
          "samsung"
        ],
        "category": "regulation"
      },
      {
        "title": "Booming Asian Markets Widen Their Lead Over US and Europe",
        "link": "https://www.bloomberg.com/news/articles/2026-02-11/investors-rush-to-join-asia-s-ai-boom-as-global-markets-whipsaw",
        "description": "In what is shaping up to be another blockbuster year, Asia’s markets are outpacing peers in the US and Europe, drawing global investors as extreme swings rattle assets from tech stocks to metals.",
        "published": "2026-02-11T00:19:28.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 3,
        "matchedKeywords": [
          "meta"
        ],
        "category": "regulation"
      }
    ],
    "crypto": [
      {
        "title": "Robinhood’s Crypto Chief on Market Turmoil",
        "link": "https://www.bloomberg.com/news/videos/2026-02-11/robinhood-s-crypto-chief-on-market-turmoil-video",
        "description": "Robinhood’s Senior VP and GM for Crypto, Johann Kerbrat, speaks with Bloomberg’s Annabelle Droulers at Consensus Hong Kong about the recent crypto rout, shifting retail and institutional flows, and how Robinhood plans to grow despite market volatility. He discusses the firm’s move into blockchain infrastructure, tokenized assets, and expansion across Asia, including acquisitions in Indonesia and Singapore. Kerbrat also shares how AI is transforming Robinhood’s operations and customer tools on Insight with Haslinda Amin. (Source: Bloomberg)",
        "published": "2026-02-11T06:50:25.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 5,
        "matchedKeywords": [
          "acquisition"
        ],
        "category": "crypto"
      },
      {
        "title": "Bullish CEO Sees Consolidation for Bitcoin in 2026",
        "link": "https://www.bloomberg.com/news/videos/2026-02-11/bullish-ceo-sees-consolidation-for-bitcoin-in-2026-video",
        "description": "Bullish CEO Tom Farley says 2026 will be a year of consolidation for crypto assets. He tells Bloomberg about his outlook for Bitcoin amid the recent slump. He speaks from the sidelines of “Consensus Hong Kong” with Bloomberg’s Annabelle Droulers. (Source: Bloomberg)",
        "published": "2026-02-11T04:29:15.000Z",
        "source": "Bloomberg",
        "sourceKey": "bloomberg_tech",
        "priority": 1,
        "image": null,
        "relevanceScore": 5,
        "matchedKeywords": [
          "ceo",
          "bitcoin"
        ],
        "category": "crypto"
      }
    ]
  },
  "totalArticles": 20
}